ipbepa/app/Http/Controllers/busController.php

select * from `buses`
---
    public function index()
    {
        $this->data['buses'] = bus::all();