ipbepa/app/Http/Controllers/GoogleController.php

select * from `users` where `google_id` = '106257955464077477441' limit 1
---
    public function handleGoogleCallback()
    {
        try {

            $user = Socialite::driver('google')->user();

            $finduser = User::where('google_id', $user->id)->first();